# Общая информатика

## Лабораторная работа № 2

### Содержание

1. Задание
2. Текст программы
3. Описание работы программы

### 1. Задание

Написать программу, умножающую 2 матрицы заданного размера и выводящую результат.

### 2. Блок-схема (не обзятельно) и/или описание алгоритма
 Для начала вспомним правила умножения матриц Количество строк матрицы [A] должно совподать с количеством столбцов матрицы [B] тогда мы полчим матрицу [C] Обозначаем переменные и указывем до каких размеров может существовать матрица ( в моём случе до 10х10) это значение можно изменять в программе если есть необходимость. Задаём количество строк и столбцов.С помощью команд cout и int вызываем массив данных и с помощью for вводим значения ячейки матрицы.После выводим матрицу А и В После этого перемножаем матрицы и в итоге выводим матрицу в командрную строку.

### 3. Текст программы

```c++
#include <iostream>
using namespace std;
int main()
{
	cout << "Hello Artem Strigunov!" << endl; //вывод на экран "Hello Artem Strigunov!" и переход на следующую строчку(<endl)
	int A[10][10], B[10][10],C[10][10], N, M, K, i, j;
	cout << "please enter the number of rows and columns for the first matrix" << endl;

	cin >> N; // количество строк 
	cin >> M; // количество столбцов первой матрицы и количество строк второй мтрицы 
	cout << "please enter the values for the first matrix" << endl;
		for (i = 0; i < N; i++) { // цикл повторяется до тех пор, пока условное значение не станет false. 
		for (j = 0; j < M; j++) {
			cin >> A[i][j]; // 
		}
	}
	cout << "Output of the first matrix" << endl;

	for (i = 0; i < N; i++) {
		for (j = 0; j < M; j++) {
			cout << A[i][j]<<"\t"; // выводим значения в матричном виде 
		}
		cout << endl;
			}// такой же цикл пишем для второй матрицы 
	cout << "please enter the number of columns for the second matrix." << endl;
	cout << "I REMIND YOU that the number of columns from the first matrix is equal to the number of rows from the second matrix" << endl;
	cin >> K; // количество столбцов второй матрицы 

	for (i = 0; i < M; i++) {
		for (j = 0; j < K; j++) {
			cin >> B[i][j];
					}
	}
	for (i = 0; i < M; i++) {
		for (j = 0; j < K; j++) {
			cout << B[i][j] << "\t"; // "\t"
					}
		cout << endl;
	}
	cout << "Please look at the matrix C " << endl;

	for (i = 0; i < N; i++) // узнаём размеры матрицы С 
	{
		for (j = 0; j < K; j++)
		{
			C[i][j] = 0; // приравниваем все значения новой матрицы "С" к нулю 
			for (int k = 0; k < M; k++) 
			{
				C[i][j] += A[i][k] * B[k][i];
			}
		}
	}
	for (int i = 0; i < N; i++)
	{
		for (int j = 0; j < K; j++)
		{
			cout << C[i][j] << " ";
		}
		cout << endl;
	}
	system("pause");
	return 0; //точка возврата 
} //конец тела программы 

### 4. Описание работы программы

Размерность матриц может задаваться  внутри программы. В программе я сразу указал условие умножение матриц. Наполнение матриц вводится с консоли. Для выполнения используется только библиотека iostream. Программа написана и протестирована при помощи компилятора Microsoft Visual Studio. 

